---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
source: html/14097470-c9d9-0143-dc1b-b93a60a460e6.htm
---
# Autodesk.Revit.DB.Events.RevitAPIPreEventArgs

The class is used as a base class for the arguments for any pre-event.

## Syntax (C#)
```csharp
public class RevitAPIPreEventArgs : RevitAPIEventArgs
```

## Remarks
A pre-event is the event raised before executing the process that was related with the event.